Revit 2024 API
BuiltInFailures.PartMakerMethodForWallFailures.CouldNotCreateWallPartDueToWallJoin Property
 Failed to create basic layer geometry due to an excessively short edge created by wall join.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CouldNotCreateWallPartDueToWallJoin { get; }
Visual Basic
Public Shared ReadOnly Property CouldNotCreateWallPartDueToWallJoin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CouldNotCreateWallPartDueToWallJoin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace